; domain
; IPC5 Domain: TPP Propositional
; Authors: Alfonso Gerevini and Alessandro Saetti

(define (domain TPP-Propositional)
(:requirements :strips :typing)
(:types place locatable level - object
	depot market - place
	truck goods - locatable)

(:predicates (loaded ?g - goods ?t - truck ?l - level)
	     (ready-to-load ?g - goods ?m - market ?l - level)
	     (stored ?g - goods ?l - level)
	     (on-sale ?g - goods ?m -  market ?l - level)
	     (next ?l1 ?l2 - level)
	     (at ?t - truck ?p - place)
	     (connected ?p1 ?p2 - place))

(:action drive
 :parameters (?t - truck ?from ?to - place)
 :precondition (and (at ?t ?from) (connected ?from ?to))
 :effect (and (not (at ?t ?from)) (at ?t ?to)))


; ### LOAD ###
; ?l1 is the level of ?g ready to be loaded at ?m before loading
; ?l2 is the level of ?g ready to be loaded at ?m after loading
; ?l3 is the level of ?g in ?t before loading
; ?l4 is the level of ?g in ?t after loading

(:action load
 :parameters (?g - goods ?t - truck ?m - market ?l1 ?l2 ?l3 ?l4 - level)
 :precondition (and (at ?t ?m) (loaded ?g ?t ?l3)
		    (ready-to-load ?g ?m ?l2) (next ?l2 ?l1) (next ?l4 ?l3))
 :effect (and (loaded ?g ?t ?l4) (not (loaded ?g ?t ?l3))
	      (ready-to-load ?g ?m ?l1) (not (ready-to-load ?g ?m ?l2))))


; ### UNLOAD ###
; ?l1 is the level of ?g in ?t before unloading
; ?l2 is the level of ?g in ?t after unloading
; ?l3 is the level of ?g in ?d before unloading
; ?l4 is the level of ?g in ?d after unloading

(:action unload
 :parameters (?g - goods ?t - truck ?d - depot ?l1 ?l2 ?l3 ?l4 - level)
 :precondition (and (at ?t ?d) (loaded ?g ?t ?l2)
		    (stored ?g ?l3) (next ?l2 ?l1) (next ?l4 ?l3))
 :effect (and (loaded ?g ?t ?l1) (not (loaded ?g ?t ?l2))
	      (stored ?g ?l4) (not (stored ?g ?l3))))


; ### BUY ###
; ?l1 is the level of ?g on sale at ?m before buying
; ?l2 is the level of ?g on sale at ?m after buying
; ?l3 is the level of ?g ready to be loaded at ?m before buying
; ?l4 is the level of ?g ready to be loaded at ?m after buying

(:action buy
 :parameters (?t - truck ?g - goods ?m - market ?l1 ?l2 ?l3 ?l4 - level)
 :precondition (and (at ?t ?m) (on-sale ?g ?m ?l2) (ready-to-load ?g ?m ?l3)
		    (next ?l2 ?l1) (next ?l4 ?l3))
 :effect (and (on-sale ?g ?m ?l1) (not (on-sale ?g ?m ?l2))
	      (ready-to-load ?g ?m ?l4) (not (ready-to-load ?g ?m ?l3))))

)

; problem
; Domain designed by Alfonso Gerevini and Alessandro Saetti
; This file has been automatically generated by the generator available from
; http://zeus.ing.unibs.it/ipc-5/generators/index.html

(define (problem TPP)
(:domain TPP-Propositional)
(:objects
	goods1 goods2 goods3 goods4 goods5 goods6 goods7 goods8 goods9 goods10 goods11 - goods
	truck1 - truck
	market1 market2 market3 market4 market5 market6 market7 - market
	depot1 depot2 - depot
	level0 level1 level2 - level)

(:init
	(next level1 level0)
	(next level2 level1)
	(ready-to-load goods1 market1 level0)
	(ready-to-load goods1 market2 level0)
	(ready-to-load goods1 market3 level0)
	(ready-to-load goods1 market4 level0)
	(ready-to-load goods1 market5 level0)
	(ready-to-load goods1 market6 level0)
	(ready-to-load goods1 market7 level0)
	(ready-to-load goods2 market1 level0)
	(ready-to-load goods2 market2 level0)
	(ready-to-load goods2 market3 level0)
	(ready-to-load goods2 market4 level0)
	(ready-to-load goods2 market5 level0)
	(ready-to-load goods2 market6 level0)
	(ready-to-load goods2 market7 level0)
	(ready-to-load goods3 market1 level0)
	(ready-to-load goods3 market2 level0)
	(ready-to-load goods3 market3 level0)
	(ready-to-load goods3 market4 level0)
	(ready-to-load goods3 market5 level0)
	(ready-to-load goods3 market6 level0)
	(ready-to-load goods3 market7 level0)
	(ready-to-load goods4 market1 level0)
	(ready-to-load goods4 market2 level0)
	(ready-to-load goods4 market3 level0)
	(ready-to-load goods4 market4 level0)
	(ready-to-load goods4 market5 level0)
	(ready-to-load goods4 market6 level0)
	(ready-to-load goods4 market7 level0)
	(ready-to-load goods5 market1 level0)
	(ready-to-load goods5 market2 level0)
	(ready-to-load goods5 market3 level0)
	(ready-to-load goods5 market4 level0)
	(ready-to-load goods5 market5 level0)
	(ready-to-load goods5 market6 level0)
	(ready-to-load goods5 market7 level0)
	(ready-to-load goods6 market1 level0)
	(ready-to-load goods6 market2 level0)
	(ready-to-load goods6 market3 level0)
	(ready-to-load goods6 market4 level0)
	(ready-to-load goods6 market5 level0)
	(ready-to-load goods6 market6 level0)
	(ready-to-load goods6 market7 level0)
	(ready-to-load goods7 market1 level0)
	(ready-to-load goods7 market2 level0)
	(ready-to-load goods7 market3 level0)
	(ready-to-load goods7 market4 level0)
	(ready-to-load goods7 market5 level0)
	(ready-to-load goods7 market6 level0)
	(ready-to-load goods7 market7 level0)
	(ready-to-load goods8 market1 level0)
	(ready-to-load goods8 market2 level0)
	(ready-to-load goods8 market3 level0)
	(ready-to-load goods8 market4 level0)
	(ready-to-load goods8 market5 level0)
	(ready-to-load goods8 market6 level0)
	(ready-to-load goods8 market7 level0)
	(ready-to-load goods9 market1 level0)
	(ready-to-load goods9 market2 level0)
	(ready-to-load goods9 market3 level0)
	(ready-to-load goods9 market4 level0)
	(ready-to-load goods9 market5 level0)
	(ready-to-load goods9 market6 level0)
	(ready-to-load goods9 market7 level0)
	(ready-to-load goods10 market1 level0)
	(ready-to-load goods10 market2 level0)
	(ready-to-load goods10 market3 level0)
	(ready-to-load goods10 market4 level0)
	(ready-to-load goods10 market5 level0)
	(ready-to-load goods10 market6 level0)
	(ready-to-load goods10 market7 level0)
	(ready-to-load goods11 market1 level0)
	(ready-to-load goods11 market2 level0)
	(ready-to-load goods11 market3 level0)
	(ready-to-load goods11 market4 level0)
	(ready-to-load goods11 market5 level0)
	(ready-to-load goods11 market6 level0)
	(ready-to-load goods11 market7 level0)
	(stored goods1 level0)
	(stored goods2 level0)
	(stored goods3 level0)
	(stored goods4 level0)
	(stored goods5 level0)
	(stored goods6 level0)
	(stored goods7 level0)
	(stored goods8 level0)
	(stored goods9 level0)
	(stored goods10 level0)
	(stored goods11 level0)
	(loaded goods1 truck1 level0)
	(loaded goods2 truck1 level0)
	(loaded goods3 truck1 level0)
	(loaded goods4 truck1 level0)
	(loaded goods5 truck1 level0)
	(loaded goods6 truck1 level0)
	(loaded goods7 truck1 level0)
	(loaded goods8 truck1 level0)
	(loaded goods9 truck1 level0)
	(loaded goods10 truck1 level0)
	(loaded goods11 truck1 level0)
	(connected market1 market2)
	(connected market1 market3)
	(connected market1 market4)
	(connected market1 market5)
	(connected market2 market1)
	(connected market2 market4)
	(connected market2 market5)
	(connected market2 market6)
	(connected market2 market7)
	(connected market3 market1)
	(connected market3 market4)
	(connected market3 market5)
	(connected market3 market6)
	(connected market3 market7)
	(connected market4 market1)
	(connected market4 market2)
	(connected market4 market3)
	(connected market4 market5)
	(connected market4 market6)
	(connected market4 market7)
	(connected market5 market1)
	(connected market5 market2)
	(connected market5 market3)
	(connected market5 market4)
	(connected market5 market6)
	(connected market5 market7)
	(connected market6 market2)
	(connected market6 market3)
	(connected market6 market4)
	(connected market6 market5)
	(connected market7 market2)
	(connected market7 market3)
	(connected market7 market4)
	(connected market7 market5)
	(connected depot1 market2)
	(connected market2 depot1)
	(connected depot2 market3)
	(connected market3 depot2)
	(on-sale goods1 market1 level1)
	(on-sale goods2 market1 level1)
	(on-sale goods3 market1 level1)
	(on-sale goods4 market1 level1)
	(on-sale goods5 market1 level1)
	(on-sale goods6 market1 level1)
	(on-sale goods7 market1 level1)
	(on-sale goods8 market1 level1)
	(on-sale goods9 market1 level1)
	(on-sale goods10 market1 level1)
	(on-sale goods11 market1 level1)
	(on-sale goods1 market2 level1)
	(on-sale goods2 market2 level1)
	(on-sale goods3 market2 level1)
	(on-sale goods4 market2 level1)
	(on-sale goods5 market2 level0)
	(on-sale goods6 market2 level1)
	(on-sale goods7 market2 level1)
	(on-sale goods8 market2 level0)
	(on-sale goods9 market2 level0)
	(on-sale goods10 market2 level1)
	(on-sale goods11 market2 level0)
	(on-sale goods1 market3 level0)
	(on-sale goods2 market3 level0)
	(on-sale goods3 market3 level0)
	(on-sale goods4 market3 level0)
	(on-sale goods5 market3 level0)
	(on-sale goods6 market3 level0)
	(on-sale goods7 market3 level0)
	(on-sale goods8 market3 level1)
	(on-sale goods9 market3 level0)
	(on-sale goods10 market3 level0)
	(on-sale goods11 market3 level0)
	(on-sale goods1 market4 level0)
	(on-sale goods2 market4 level0)
	(on-sale goods3 market4 level0)
	(on-sale goods4 market4 level0)
	(on-sale goods5 market4 level1)
	(on-sale goods6 market4 level0)
	(on-sale goods7 market4 level0)
	(on-sale goods8 market4 level0)
	(on-sale goods9 market4 level0)
	(on-sale goods10 market4 level0)
	(on-sale goods11 market4 level1)
	(on-sale goods1 market5 level0)
	(on-sale goods2 market5 level0)
	(on-sale goods3 market5 level0)
	(on-sale goods4 market5 level0)
	(on-sale goods5 market5 level0)
	(on-sale goods6 market5 level0)
	(on-sale goods7 market5 level0)
	(on-sale goods8 market5 level0)
	(on-sale goods9 market5 level0)
	(on-sale goods10 market5 level0)
	(on-sale goods11 market5 level0)
	(on-sale goods1 market6 level0)
	(on-sale goods2 market6 level0)
	(on-sale goods3 market6 level0)
	(on-sale goods4 market6 level0)
	(on-sale goods5 market6 level0)
	(on-sale goods6 market6 level0)
	(on-sale goods7 market6 level0)
	(on-sale goods8 market6 level0)
	(on-sale goods9 market6 level0)
	(on-sale goods10 market6 level0)
	(on-sale goods11 market6 level0)
	(on-sale goods1 market7 level0)
	(on-sale goods2 market7 level0)
	(on-sale goods3 market7 level0)
	(on-sale goods4 market7 level0)
	(on-sale goods5 market7 level0)
	(on-sale goods6 market7 level0)
	(on-sale goods7 market7 level0)
	(on-sale goods8 market7 level0)
	(on-sale goods9 market7 level1)
	(on-sale goods10 market7 level0)
	(on-sale goods11 market7 level0)
	(at truck1 depot1))

(:goal (and
	(stored goods1 level2)
	(stored goods2 level2)
	(stored goods3 level2)
	(stored goods4 level2)
	(stored goods5 level2)
	(stored goods6 level1)
	(stored goods7 level1)
	(stored goods8 level2)
	(stored goods9 level1)
	(stored goods10 level1)
	(stored goods11 level2)))

)

; plan
1. (drive truck1 depot1 market2)
   deleted: (at truck1 depot1)
   added: (at truck1 market2)
   goals met: 0 of 11
2. (buy truck1 goods4 market2 level0 level1 level0 level1)
   deleted: (on-sale goods4 market2 level1) (ready-to-load goods4 market2 level0)
   added: (on-sale goods4 market2 level0) (ready-to-load goods4 market2 level1)
   goals met: 0 of 11
3. (load goods4 truck1 market2 level0 level1 level0 level1)
   deleted: (loaded goods4 truck1 level0) (ready-to-load goods4 market2 level1)
   added: (loaded goods4 truck1 level1) (ready-to-load goods4 market2 level0)
   goals met: 0 of 11
4. (buy truck1 goods3 market2 level0 level1 level0 level1)
   deleted: (on-sale goods3 market2 level1) (ready-to-load goods3 market2 level0)
   added: (on-sale goods3 market2 level0) (ready-to-load goods3 market2 level1)
   goals met: 0 of 11
5. (load goods3 truck1 market2 level0 level1 level0 level1)
   deleted: (loaded goods3 truck1 level0) (ready-to-load goods3 market2 level1)
   added: (loaded goods3 truck1 level1) (ready-to-load goods3 market2 level0)
   goals met: 0 of 11
6. (buy truck1 goods2 market2 level0 level1 level0 level1)
   deleted: (on-sale goods2 market2 level1) (ready-to-load goods2 market2 level0)
   added: (on-sale goods2 market2 level0) (ready-to-load goods2 market2 level1)
   goals met: 0 of 11
7. (load goods2 truck1 market2 level0 level1 level0 level1)
   deleted: (loaded goods2 truck1 level0) (ready-to-load goods2 market2 level1)
   added: (loaded goods2 truck1 level1) (ready-to-load goods2 market2 level0)
   goals met: 0 of 11
8. (buy truck1 goods1 market2 level0 level1 level0 level1)
   deleted: (on-sale goods1 market2 level1) (ready-to-load goods1 market2 level0)
   added: (on-sale goods1 market2 level0) (ready-to-load goods1 market2 level1)
   goals met: 0 of 11
9. (load goods1 truck1 market2 level0 level1 level0 level1)
   deleted: (loaded goods1 truck1 level0) (ready-to-load goods1 market2 level1)
   added: (loaded goods1 truck1 level1) (ready-to-load goods1 market2 level0)
   goals met: 0 of 11
10. (drive truck1 market2 market4)
   deleted: (at truck1 market2)
   added: (at truck1 market4)
   goals met: 0 of 11
11. (buy truck1 goods5 market4 level0 level1 level0 level1)
   deleted: (on-sale goods5 market4 level1) (ready-to-load goods5 market4 level0)
   added: (on-sale goods5 market4 level0) (ready-to-load goods5 market4 level1)
   goals met: 0 of 11
12. (load goods5 truck1 market4 level0 level1 level0 level1)
   deleted: (loaded goods5 truck1 level0) (ready-to-load goods5 market4 level1)
   added: (loaded goods5 truck1 level1) (ready-to-load goods5 market4 level0)
   goals met: 0 of 11
13. (buy truck1 goods11 market4 level0 level1 level0 level1)
   deleted: (on-sale goods11 market4 level1) (ready-to-load goods11 market4 level0)
   added: (on-sale goods11 market4 level0) (ready-to-load goods11 market4 level1)
   goals met: 0 of 11
14. (load goods11 truck1 market4 level0 level1 level0 level1)
   deleted: (loaded goods11 truck1 level0) (ready-to-load goods11 market4 level1)
   added: (loaded goods11 truck1 level1) (ready-to-load goods11 market4 level0)
   goals met: 0 of 11
15. (drive truck1 market4 market1)
   deleted: (at truck1 market4)
   added: (at truck1 market1)
   goals met: 0 of 11
16. (buy truck1 goods9 market1 level0 level1 level0 level1)
   deleted: (on-sale goods9 market1 level1) (ready-to-load goods9 market1 level0)
   added: (on-sale goods9 market1 level0) (ready-to-load goods9 market1 level1)
   goals met: 0 of 11
17. (load goods9 truck1 market1 level0 level1 level0 level1)
   deleted: (loaded goods9 truck1 level0) (ready-to-load goods9 market1 level1)
   added: (loaded goods9 truck1 level1) (ready-to-load goods9 market1 level0)
   goals met: 0 of 11
18. (buy truck1 goods8 market1 level0 level1 level0 level1)
   deleted: (on-sale goods8 market1 level1) (ready-to-load goods8 market1 level0)
   added: (on-sale goods8 market1 level0) (ready-to-load goods8 market1 level1)
   goals met: 0 of 11
19. (load goods8 truck1 market1 level0 level1 level0 level1)
   deleted: (loaded goods8 truck1 level0) (ready-to-load goods8 market1 level1)
   added: (loaded goods8 truck1 level1) (ready-to-load goods8 market1 level0)
   goals met: 0 of 11
20. (buy truck1 goods7 market1 level0 level1 level0 level1)
   deleted: (on-sale goods7 market1 level1) (ready-to-load goods7 market1 level0)
   added: (on-sale goods7 market1 level0) (ready-to-load goods7 market1 level1)
   goals met: 0 of 11
21. (load goods7 truck1 market1 level0 level1 level0 level1)
   deleted: (loaded goods7 truck1 level0) (ready-to-load goods7 market1 level1)
   added: (loaded goods7 truck1 level1) (ready-to-load goods7 market1 level0)
   goals met: 0 of 11
22. (buy truck1 goods6 market1 level0 level1 level0 level1)
   deleted: (on-sale goods6 market1 level1) (ready-to-load goods6 market1 level0)
   added: (on-sale goods6 market1 level0) (ready-to-load goods6 market1 level1)
   goals met: 0 of 11
23. (load goods6 truck1 market1 level0 level1 level0 level1)
   deleted: (loaded goods6 truck1 level0) (ready-to-load goods6 market1 level1)
   added: (loaded goods6 truck1 level1) (ready-to-load goods6 market1 level0)
   goals met: 0 of 11
24. (buy truck1 goods5 market1 level0 level1 level0 level1)
   deleted: (on-sale goods5 market1 level1) (ready-to-load goods5 market1 level0)
   added: (on-sale goods5 market1 level0) (ready-to-load goods5 market1 level1)
   goals met: 0 of 11
25. (load goods5 truck1 market1 level0 level1 level1 level2)
   deleted: (loaded goods5 truck1 level1) (ready-to-load goods5 market1 level1)
   added: (loaded goods5 truck1 level2) (ready-to-load goods5 market1 level0)
   goals met: 0 of 11
26. (buy truck1 goods4 market1 level0 level1 level0 level1)
   deleted: (on-sale goods4 market1 level1) (ready-to-load goods4 market1 level0)
   added: (on-sale goods4 market1 level0) (ready-to-load goods4 market1 level1)
   goals met: 0 of 11
27. (load goods4 truck1 market1 level0 level1 level1 level2)
   deleted: (loaded goods4 truck1 level1) (ready-to-load goods4 market1 level1)
   added: (loaded goods4 truck1 level2) (ready-to-load goods4 market1 level0)
   goals met: 0 of 11
28. (buy truck1 goods3 market1 level0 level1 level0 level1)
   deleted: (on-sale goods3 market1 level1) (ready-to-load goods3 market1 level0)
   added: (on-sale goods3 market1 level0) (ready-to-load goods3 market1 level1)
   goals met: 0 of 11
29. (load goods3 truck1 market1 level0 level1 level1 level2)
   deleted: (loaded goods3 truck1 level1) (ready-to-load goods3 market1 level1)
   added: (loaded goods3 truck1 level2) (ready-to-load goods3 market1 level0)
   goals met: 0 of 11
30. (buy truck1 goods2 market1 level0 level1 level0 level1)
   deleted: (on-sale goods2 market1 level1) (ready-to-load goods2 market1 level0)
   added: (on-sale goods2 market1 level0) (ready-to-load goods2 market1 level1)
   goals met: 0 of 11
31. (load goods2 truck1 market1 level0 level1 level1 level2)
   deleted: (loaded goods2 truck1 level1) (ready-to-load goods2 market1 level1)
   added: (loaded goods2 truck1 level2) (ready-to-load goods2 market1 level0)
   goals met: 0 of 11
32. (buy truck1 goods11 market1 level0 level1 level0 level1)
   deleted: (on-sale goods11 market1 level1) (ready-to-load goods11 market1 level0)
   added: (on-sale goods11 market1 level0) (ready-to-load goods11 market1 level1)
   goals met: 0 of 11
33. (load goods11 truck1 market1 level0 level1 level1 level2)
   deleted: (loaded goods11 truck1 level1) (ready-to-load goods11 market1 level1)
   added: (loaded goods11 truck1 level2) (ready-to-load goods11 market1 level0)
   goals met: 0 of 11
34. (buy truck1 goods10 market1 level0 level1 level0 level1)
   deleted: (on-sale goods10 market1 level1) (ready-to-load goods10 market1 level0)
   added: (on-sale goods10 market1 level0) (ready-to-load goods10 market1 level1)
   goals met: 0 of 11
35. (load goods10 truck1 market1 level0 level1 level0 level1)
   deleted: (loaded goods10 truck1 level0) (ready-to-load goods10 market1 level1)
   added: (loaded goods10 truck1 level1) (ready-to-load goods10 market1 level0)
   goals met: 0 of 11
36. (buy truck1 goods1 market1 level0 level1 level0 level1)
   deleted: (on-sale goods1 market1 level1) (ready-to-load goods1 market1 level0)
   added: (on-sale goods1 market1 level0) (ready-to-load goods1 market1 level1)
   goals met: 0 of 11
37. (load goods1 truck1 market1 level0 level1 level1 level2)
   deleted: (loaded goods1 truck1 level1) (ready-to-load goods1 market1 level1)
   added: (loaded goods1 truck1 level2) (ready-to-load goods1 market1 level0)
   goals met: 0 of 11
38. (drive truck1 market1 market3)
   deleted: (at truck1 market1)
   added: (at truck1 market3)
   goals met: 0 of 11
39. (buy truck1 goods8 market3 level0 level1 level0 level1)
   deleted: (on-sale goods8 market3 level1) (ready-to-load goods8 market3 level0)
   added: (on-sale goods8 market3 level0) (ready-to-load goods8 market3 level1)
   goals met: 0 of 11
40. (load goods8 truck1 market3 level0 level1 level1 level2)
   deleted: (loaded goods8 truck1 level1) (ready-to-load goods8 market3 level1)
   added: (loaded goods8 truck1 level2) (ready-to-load goods8 market3 level0)
   goals met: 0 of 11
41. (drive truck1 market3 depot2)
   deleted: (at truck1 market3)
   added: (at truck1 depot2)
   goals met: 0 of 11
42. (unload goods11 truck1 depot2 level1 level2 level0 level1)
   deleted: (loaded goods11 truck1 level2) (stored goods11 level0)
   added: (loaded goods11 truck1 level1) (stored goods11 level1)
   goals met: 0 of 11
43. (unload goods11 truck1 depot2 level0 level1 level1 level2)
   deleted: (loaded goods11 truck1 level1) (stored goods11 level1)
   added: (loaded goods11 truck1 level0) (stored goods11 level2)
   goals met: 1 of 11
44. (unload goods10 truck1 depot2 level0 level1 level0 level1)
   deleted: (loaded goods10 truck1 level1) (stored goods10 level0)
   added: (loaded goods10 truck1 level0) (stored goods10 level1)
   goals met: 2 of 11
45. (unload goods1 truck1 depot2 level1 level2 level0 level1)
   deleted: (loaded goods1 truck1 level2) (stored goods1 level0)
   added: (loaded goods1 truck1 level1) (stored goods1 level1)
   goals met: 2 of 11
46. (unload goods1 truck1 depot2 level0 level1 level1 level2)
   deleted: (loaded goods1 truck1 level1) (stored goods1 level1)
   added: (loaded goods1 truck1 level0) (stored goods1 level2)
   goals met: 3 of 11
47. (unload goods2 truck1 depot2 level1 level2 level0 level1)
   deleted: (loaded goods2 truck1 level2) (stored goods2 level0)
   added: (loaded goods2 truck1 level1) (stored goods2 level1)
   goals met: 3 of 11
48. (unload goods2 truck1 depot2 level0 level1 level1 level2)
   deleted: (loaded goods2 truck1 level1) (stored goods2 level1)
   added: (loaded goods2 truck1 level0) (stored goods2 level2)
   goals met: 4 of 11
49. (unload goods3 truck1 depot2 level1 level2 level0 level1)
   deleted: (loaded goods3 truck1 level2) (stored goods3 level0)
   added: (loaded goods3 truck1 level1) (stored goods3 level1)
   goals met: 4 of 11
50. (unload goods3 truck1 depot2 level0 level1 level1 level2)
   deleted: (loaded goods3 truck1 level1) (stored goods3 level1)
   added: (loaded goods3 truck1 level0) (stored goods3 level2)
   goals met: 5 of 11
51. (unload goods4 truck1 depot2 level1 level2 level0 level1)
   deleted: (loaded goods4 truck1 level2) (stored goods4 level0)
   added: (loaded goods4 truck1 level1) (stored goods4 level1)
   goals met: 5 of 11
52. (unload goods4 truck1 depot2 level0 level1 level1 level2)
   deleted: (loaded goods4 truck1 level1) (stored goods4 level1)
   added: (loaded goods4 truck1 level0) (stored goods4 level2)
   goals met: 6 of 11
53. (unload goods5 truck1 depot2 level1 level2 level0 level1)
   deleted: (loaded goods5 truck1 level2) (stored goods5 level0)
   added: (loaded goods5 truck1 level1) (stored goods5 level1)
   goals met: 6 of 11
54. (unload goods5 truck1 depot2 level0 level1 level1 level2)
   deleted: (loaded goods5 truck1 level1) (stored goods5 level1)
   added: (loaded goods5 truck1 level0) (stored goods5 level2)
   goals met: 7 of 11
55. (unload goods6 truck1 depot2 level0 level1 level0 level1)
   deleted: (loaded goods6 truck1 level1) (stored goods6 level0)
   added: (loaded goods6 truck1 level0) (stored goods6 level1)
   goals met: 8 of 11
56. (unload goods7 truck1 depot2 level0 level1 level0 level1)
   deleted: (loaded goods7 truck1 level1) (stored goods7 level0)
   added: (loaded goods7 truck1 level0) (stored goods7 level1)
   goals met: 9 of 11
57. (unload goods8 truck1 depot2 level1 level2 level0 level1)
   deleted: (loaded goods8 truck1 level2) (stored goods8 level0)
   added: (loaded goods8 truck1 level1) (stored goods8 level1)
   goals met: 9 of 11
58. (unload goods8 truck1 depot2 level0 level1 level1 level2)
   deleted: (loaded goods8 truck1 level1) (stored goods8 level1)
   added: (loaded goods8 truck1 level0) (stored goods8 level2)
   goals met: 10 of 11
59. (unload goods9 truck1 depot2 level0 level1 level0 level1)
   deleted: (loaded goods9 truck1 level1) (stored goods9 level0)
   added: (loaded goods9 truck1 level0) (stored goods9 level1)
   goals met: 11 of 11
